app/views/devise/registrations/edit.html.erb

      <%= f.label :laboratorio %><br />
      <%= f.collection_select :lab_id, Laboratory.all, :id, :nombre %>
---
SELECT "laboratories".* FROM "laboratories"