app/views/devise/registrations/new.html.erb

SELECT "laboratories".* FROM "laboratories"
---
     <%= f.label :laboratorio %><br />
     <%= f.collection_select :lab_id, Laboratory.all, :id, :nombre %>