app/views/records/index.html.erb

    <%end%>
    <% if record.student.laboratories.ids.include?(@laboratory.id)%>
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "laboratories"."id" FROM "laboratories" INNER JOIN "laboratories_students" ON "laboratories"."id" = "laboratories_students"."laboratory_id" WHERE "laboratories_students"."student_id" = $1  [["student_id", 1]]

      <%end%>
       <% if record.student.laboratories.ids.include?(@laboratory.id)%>
---
SELECT "laboratories"."id" FROM "laboratories" INNER JOIN "laboratories_students" ON "laboratories"."id" = "laboratories_students"."laboratory_id" WHERE "laboratories_students"."student_id" = $1  [["student_id", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

       <%end%>
       <% if record.student.laboratories.ids.include?(@laboratory.id)%>
---
SELECT "laboratories"."id" FROM "laboratories" INNER JOIN "laboratories_students" ON "laboratories"."id" = "laboratories_students"."laboratory_id" WHERE "laboratories_students"."student_id" = $1  [["student_id", 5]]

    <td><%=link_to s.nombre, s%></td>
    <td><%=s.records.count%></td>
---
SELECT "records".* FROM "records" WHERE "records"."created_at" BETWEEN $1 AND $2  [["created_at", "2019-03-10 00:00:00"], ["created_at", "2019-03-10 23:59:59.999999"]]