app/views/records/index.html.erb

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "laboratories"."id" FROM "laboratories" INNER JOIN "laboratories_students" ON "laboratories"."id" = "laboratories_students"."laboratory_id" WHERE "laboratories_students"."student_id" = $1  [["student_id", 5]]
---
    --->
    <% if record.student.laboratories.ids.include?(@laboratory.id)%>

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      ----->
      <% if record.student.laboratories.ids.include?(@laboratory.id)%>