app/controllers/laboratories_controller.rb

SELECT "laboratories".* FROM "laboratories"
---
  def index
    @laboratories = Laboratory.all

SELECT  "laboratories".* FROM "laboratories" WHERE "laboratories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def new_admin
    @laboratory = Laboratory.find(params[:laboratory_id])
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_admin
    @user = User.find(params[:user_id])

INSERT INTO "laboratories" ("nombre", "facultad", "campus", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @laboratory = Laboratory.new(laboratory_params)

    respond_to do |format|
      if @laboratory.save

UPDATE "laboratories" SET "nombre" = $1, "updated_at" = $2 WHERE "laboratories"."id" = $3  [["nombre", "Fablab UC"], ["updated_at", "2019-01-20 20:21:08.534487"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @laboratory.update(laboratory_params)

SELECT  "laboratories".* FROM "laboratories" WHERE "laboratories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_laboratory
      @laboratory = Laboratory.find(params[:id])