app/controllers/records_controller.rb

SELECT "records".* FROM "records"
---
    def index
        @record_all = Record.all

SELECT  "laboratories".* FROM "laboratories" WHERE "laboratories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "records" ("tipo", "student_id", "created_at") VALUES ($1, $2, $3) RETURNING "id"  [["tipo", "Ingreso"], ["student_id", 1], ["created_at", "2019-02-12 13:39:06.304039"]]
---
    def expulse
        if @current_user.rol == "admin"
            sign_out_and_redirect(current_user)
        else
            @laboratory = Laboratory.find(current_user.lab_id)
            @record_all = Record.where(lab_id: @laboratory.id)
            @records_day = @record_all.where(created_at: Time.zone.now.beginning_of_day..Time.zone.now.end_of_day)
            @records_day.each do |record|
                if not record.student.status
                    @record_new = record.student.records.new(:tipo => record.student.status, :lab_id =>record.lab_id, :foul => true, :description => "Estudiante no generó registro de salida en laboratorio.")
                    @record_new.save

SELECT "students"."id" FROM "students" WHERE "students"."rfid" = $1  [["rfid", "803941AF2"]]
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."rfid" = $1 LIMIT $2  [["rfid", "803941AF2"], ["LIMIT", 11]]
INSERT INTO "records" ("id_usuario", "tipo", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["id_usuario", 1], ["tipo", "in"], ["created_at", "2019-01-30 00:56:40.986559"], ["updated_at", "2019-01-30 00:56:40.986559"]]
---
    def create
        student = Student.where(rfid: params[:rfid])[0]
        if student
            if student.status.nil?
                student.status = true
                student.save
            end
            if student.records.any?
                if student.records.last.tipo == 't' && student.records.last.lab_id.to_i != params[:lab_id].to_i
                    @checkout = student.records.new({:tipo => 'f', :lab_id => student.records.last.lab_id, :foul=>true, :description => "Estudiante no generó registro de salida en laboratorio y generó registro de entrada en otro laboratorio."})
                    @checkout.save