app/controllers/records_controller.rb

SELECT  "laboratories".* FROM "laboratories" WHERE "laboratories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "records".* FROM "records" WHERE "records"."created_at" BETWEEN $1 AND $2 AND "records"."lab_id" = $3  [["created_at", "2019-03-10 00:00:00"], ["created_at", "2019-03-10 23:59:59.999999"], ["lab_id", 2]]
---
    def index
        @laboratory = Laboratory.find(current_user.lab_id)
        @records_day = Record.where(created_at: Time.zone.now.beginning_of_day..Time.zone.now.end_of_day)
        @records_day = @records_day.where(lab_id: @laboratory.id)

SELECT "students"."id" FROM "students" WHERE "students"."rfid" = $1  [["rfid", "803941AF2"]]
---
    def create
        student = Student.where(rfid: params[:rfid])[0]