app/controllers/records_controller.rb

    def index
        @students_ranking = Student
        .left_joins(:records)
        .group(:id)
        .order('COUNT(records.id) DESC')
        .limit(35)
        @laboratory = Laboratory.find(current_user.lab_id)
---
SELECT  "records".* FROM "records" WHERE "records"."created_at" BETWEEN $1 AND $2 AND "records"."lab_id" = $3 LIMIT $4  [["created_at", "2019-03-04 00:00:00"], ["created_at", "2019-03-10 23:59:59.999999"], ["lab_id", 2], ["LIMIT", 11]]