app/controllers/students_controller.rb

  def check_student_wallet
    rut = params[:rut]
    last_char = rut[-1]
    if last_char == 'k'
      rut[-1] = last_char.upcase
    end
    student = Student.find_by(rut: rut)
    unless student.laboratories.where(id: params[:lab_id]).exists?
---
SELECT  "laboratories".* FROM "laboratories" INNER JOIN "laboratories_students" ON "laboratories"."id" = "laboratories_students"."laboratory_id" WHERE "laboratories_students"."student_id" = $1 AND "laboratories"."id" = $2 LIMIT $3  [["student_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "laboratories" INNER JOIN "laboratories_students" ON "laboratories"."id" = "laboratories_students"."laboratory_id" WHERE "laboratories_students"."student_id" = $1 AND "laboratories"."id" IS NULL LIMIT $2  [["student_id", 3], ["LIMIT", 1]]

  def enroll
    @student = Student.find(params[:student_id])
    @labs = Laboratory.find(params[:lab_id])
    @student.each do |student|
      unless student.laboratories.include? @labs
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "laboratories".* FROM "laboratories" INNER JOIN "laboratories_students" ON "laboratories"."id" = "laboratories_students"."laboratory_id" WHERE "laboratories_students"."student_id" = $1 AND "laboratories"."id" = $2 LIMIT $3  [["student_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "laboratories" INNER JOIN "laboratories_students" ON "laboratories"."id" = "laboratories_students"."laboratory_id" WHERE "laboratories_students"."student_id" = $1 AND "laboratories"."id" IS NULL LIMIT $2  [["student_id", 3], ["LIMIT", 1]]