app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "laboratories".* FROM "laboratories" WHERE "laboratories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "students" ("rfid", "nombre", "nalumno", "sit_academica", "correo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def enroll
    @student = Student.find(params[:student_id])
    @labs = Laboratory.find(current_user.lab_id)
    @student.each do |student|
       student.laboratories << @labs

INSERT INTO "students" ("rfid", "nombre", "nalumno", "sit_academica", "correo", "created_at", "updated_at", "rut") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save

UPDATE "students" SET "rfid" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["rfid", "803941AF2"], ["updated_at", "2019-02-12 11:15:11.099897"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @student.update(student_params)