app/controllers/visits_controller.rb

SELECT  "laboratories".* FROM "laboratories" WHERE "laboratories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "visits".* FROM "visits" WHERE "visits"."created_at" BETWEEN $1 AND $2  [["created_at", "2019-03-10 00:00:00"], ["created_at", "2019-03-10 23:59:59.999999"]]
SELECT "visits".* FROM "visits" WHERE "visits"."created_at" BETWEEN $1 AND $2 AND "visits"."lab_id" = $3 AND "visits"."lab_id" = $4  [["created_at", "2019-03-04 00:00:00"], ["created_at", "2019-03-10 23:59:59.999999"], ["lab_id", 2], ["lab_id", 2]]
---
    def index
        @laboratory = Laboratory.find(current_user.lab_id)
        @visits_day = Visit.where(created_at: Time.zone.now.beginning_of_day..Time.zone.now.end_of_day)
        @visits_day = @visits_day.where(lab_id: @laboratory.id)

SELECT "students".* FROM "students" WHERE "students"."rut" = $1  [["rut", "19065385-4"]]
UPDATE "students" SET "status" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["status", true], ["updated_at", "2019-03-14 16:21:18.801351"], ["id", 1]]
INSERT INTO "records" ("student_id", "created_at", "lab_id") VALUES ($1, $2, $3) RETURNING "id"  [["student_id", 1], ["created_at", "2019-03-14 16:22:51.108291"], ["lab_id", 1]]
UPDATE "students" SET "status" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["status", false], ["updated_at", "2019-03-14 16:21:19.115175"], ["id", 1]]
INSERT INTO "visits" ("rut", "motivo", "institucion", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["rut", "19065385-4"], ["motivo", "personal"], ["institucion", "uc"], ["created_at", "2019-03-05 17:11:00.014562"], ["updated_at", "2019-03-05 17:11:00.014562"]]
---
    def create
        student = Student.where(rut: params[:rut])[0]
        if student
            if student.status.nil?
                student.status = true
                student.save
            end
            @record = student.records.new({:tipo => params[:tipo], :lab_id =>params[:lab_id]})
            respond_to do |format|
            if @record.save
                format.json {render json: {'type': 'student', 'data': {student: @record.student, laboratory: @record.student.laboratories}}, status: 200}
            else
                format.json {render json: @record.errors, status: :unprocessable_entity}
            end
            end
            student.status = !student.status
            student.save
        else

            @visit = Visit.new(rut: params[:rut], motivo: params[:motivo], institucion: params[:institucion], lab_id: params[:lab_id])
            respond_to do |format|
            if @visit.save