app/models/record.rb

    def self.import(file)
        CSV.foreach(file.path, headers: true) do |row|
            hashrow = row.to_hash
            student = Student.where(rfid: hashrow['rfid'])[0]
            if student.status.nil?
                student.status = true
                student.save
            end
            @record = student.records.new({:tipo => student.status,
                                           :created_at =>hashrow['created_at'],
                                           :lab_id =>hashrow['lab_id']})
            student.status = !student.status
            student.save
            @record.save
---
SELECT "students".* FROM "students" WHERE "students"."rfid" = $1  [["rfid", "8af1345ea"]]
UPDATE "students" SET "status" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["status", true], ["updated_at", "2019-03-12 16:07:15.600262"], ["id", 5]]
INSERT INTO "records" ("tipo", "student_id", "created_at", "lab_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tipo", "t"], ["student_id", 5], ["created_at", "2019-03-12 13:36:00"], ["lab_id", 1]]
UPDATE "students" SET "status" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["status", false], ["updated_at", "2019-03-12 16:17:04.374788"], ["id", 5]]