app/models/visit.rb

SELECT "students".* FROM "students" WHERE "students"."rut" = $1  [["rut", "19065385-4"]]
INSERT INTO "records" ("student_id", "created_at") VALUES ($1, $2) RETURNING "id"  [["student_id", 1], ["created_at", "2019-02-09 23:53:44.221309"]]
INSERT INTO "visits" ("rut", "motivo", "institucion", "created_at", "updated_at", "lab_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["rut", "1s905-4"], ["motivo", "Académica"], ["institucion", "Otro"], ["created_at", "2019-02-09 23:53:44"], ["updated_at", "2019-03-10 18:53:32.711634"], ["lab_id", 1]]
---
    def self.import(file)
        CSV.foreach(file.path, headers: true) do |row|
            hashrow = row.to_hash
            student = Student.where(rut: hashrow['rut'])[0]
            if student
                @record = student.records.new({:tipo => hashrow['tipo'],
                                               :created_at =>hashrow['created_at'],
                                               :lab_id => hashrow['lab_id']})
                @record.save
            else
                @visit = Visit.new(rut: hashrow['rut'],
                                   created_at: hashrow['created_at'],
                                   motivo: hashrow['motivo'],
                                   institucion: hashrow['institucion'],
                                   lab_id: hashrow['lab_id'])
                @visit.save